000100210422       DCL-F WORKWEEK2 USAGE(*INPUT:*UPDATE:*DELETE:*OUTPUT) KEYED
000101210422            RENAME(WORKWEEK1:WORKWEEKR);
000102210421       DCL-F EMPDSP8 WORKSTN;
000103210421       DCL-F EMPLOYE2 DISK USAGE(*INPUT:*UPDATE) KEYED
000104210421         RENAME(EMPLOYEE:EMPLOYEER);
000105210421       DCL-S OVERHRS FLOAT(8);
000106210421       DCL-S RATES FLOAT(8);
000107210421
000108210421       EXFMT RECORD1;
000109210421       DOW *IN03 = *OFF;
000110210422
000111210422         CHAIN EMPNUMIN EMPLOYEER;
000112210421         IF NOT %FOUND;
000113210421           *IN51 = *ON;
000114210421           ERRORMSG = 'No matching record in Employee File';
000115210421           EXFMT RECORD1;
000116210421           ERRORMSG = ' ';
000117210421           *IN51 = *OFF;
000119210421           ITER;
000120210421         ENDIF;
000121210422
000122210422         CHAIN EMPNUMIN WORKWEEKR;
000123210421         IF NOT %FOUND;
000124210421           *IN51 = *ON;
000125210422           ERRORMSG = 'No matching record in Workweek File';
000126210421           EXFMT RECORD1;
000127210421           ERRORMSG = ' ';
000128210421           *IN51 = *OFF;
000129210421           EMPNUMIN = 0;
000130210421           ITER;
000131210421         ENDIF;
000132210421
000133210421         EXSR GETPAYR;
000134210421
000135210421         *IN99 = *ON;     //* for protecting feild *//
000136210421         WRITE RECORD1;
000137210421         EXFMT RECORD2;
000138210421         *IN99 = *OFF;
000139210421
000140210421         IF *IN06;
000142210422           UPDATE EMPLOYEER;
000143210422           DELETE WORKWEEKR;
000145210422           WRITE  WORKWEEKR;
000146210422
000147210421         ENDIF;
000148210421
000149210421         IF NOT *IN03;
000150210421           EMPNUMIN = 0;
000151210421           EXFMT RECORD1;
000152210421         ENDIF;
000153210421       ENDDO;
000154210421       *INLR = *ON;
000155210421       RETURN;
000156210421
000157210421       BEGSR GETPAYR;
000158210421         SELECT;
000159210421           WHEN WORKSHIFT = 'D';
000160210421             SHIFTTYPE = 'DAYS';
000161210421             RATES = 25.75;
000162210421           WHEN WORKSHIFT = 'A';
000163210421             SHIFTTYPE = 'AFTERNOON';
000164210421             RATES = 27.55;
000165210421           WHEN WORKSHIFT = 'N';
000166210421             SHIFTTYPE = 'NIGHTS';
000167210421             RATES = 29.77;
000168210421         ENDSL;
000169210421
000170210421         OVERHRS = HRSWORKED - 40;
000171210421
000172210421         SELECT;
000173210421           WHEN PAYGRADE = '1';
000174210421             RATES *= 1.094;
000175210421           WHEN PAYGRADE = '2';
000176210421             RATES *= 1.062;
000177210421           WHEN PAYGRADE = '3';
000178210421             RATES *= 0.957;
000179210421         ENDSL;
000180210421
000181210421         IF OVERHRS > 0;
000182210421           EVAL(H) OVRPAY = RATES * OVERHRS * 1.5;
000183210421           EVAL(H) REGPAY = RATES * 40.00;
000184210421         ELSE;
000185210421           OVRPAY = 0;
000186210421           EVAL(H) REGPAY = RATES * HRSWORKED * 1.00;
000187210421         ENDIF;
000188210421           SHFTPAY = REGPAY + OVRPAY;
000189210421           YTDPAY += SHFTPAY;
000190210421       ENDSR;
