000010210218     A*%%TS  SD  20210201  151602  PANGBORN    REL-V7R4M0  5770-WDS
000020210201     A*%%EC
000030210201     A                                      DSPSIZ(24 80 *DS3)
000031210223     A                                      CF21(21 'COMMAND LINE')
000040210201     A          R RECORD1
000050210201     A*%%TS  SD  20210201  151602  PANGBORN    REL-V7R4M0  5770-WDS
000051210216     A                                      CF03(03 'EXIT KEY')
000060210201     A                                  1 38'Lab 4'
000070210201     A                                  5  3'Please select one of the following-
000080210201     A                                       options:'
000090210201     A                                  9 14'3.  Maximum Invalid Signon Attempt-
000100210201     A                                      s allowed'
000110210201     A                                 11 14'5.  Operating system level'
000120210223     A                                  7 14'1.  Signed on User Message Queue'
000121210223
000130210223     A
000140210201     A                                 15 17'Option:'
000150210201     A                                 23  4'F3=Exit'
000160210201     A                                 23 17'F21=Comand Line '
000170210216     A                                  2  3'Lara Fahmi'
000180210201     A                                 10 14'4.  Previous sign on by signed on -
000190210201     A                                      user'
000200210201     A                                  8 14'2.  Run Covid Information Applicat-
000210210201     A                                      ion'
000211210218     A            OPTION         2   B 15 26
000212210218     A  30                                  DSPATR(RI)
000213210218     A  30                                  DSPATR(PC)
000215210216     A  30                             16 30'Invalid Option'
000216210216     A            MSGTXT        70   O 20  4
000217210225     A            MSGTXT1       70   O 21  4
000218210223     A            MSGTXT2       70   O 21  5
000221210223     A                                  2 70TIME
000222210223     A                                  1 70DATE
000223210223     A                                      EDTCDE(Y)
000224210223
