000100210216             CALL       QGPL/STRJOB
000101210216             ADDLIBLE   BCI433LIB
000102210216             MONMSG     MSGID(CPF2103)
000103210216             DSPSYSLVL  OUTPUT(*DISPLAY)
000104210216
000105210216
